configuration.org
Sam's Emacs Config
* Personal Specific
** Add Gnus for personal email
#+begin_src emacs-lisp
  (when (member (system-name) '("notestation" "fossastation"))
    (setq
     user-full-name "Samuel Banya"
     user-mail-address "sbanya@fastmail.com"
     send-mail-function 'smtpmail-send-it
     smtpmail-smtp-server "smtp.fastmail.com"
     smtpmail-stream-type 'starttls
     smtpmail-smtp-service 587
     gnus-select-method
     '(nnimap "fastmail"
	      (nnimap-user "sbanya@fastmail.com")
	      (nnimap-address "imap.fastmail.com")
	      (nnimap-server-port 993)
	      (nnimap-stream ssl)
	      (nnmail-expiry-wait immediate))))
#+end_src
** Add 'elfeed-org' for a nicer org file for RSS feeds for 'elfeed' RSS feed reader
#+BEGIN_SRC emacs-lisp
  (when (member (system-name) '("notestation" "fossastation"))
      (use-package elfeed-org
	:ensure t
	:config
	(elfeed-org)
	(setq rmh-elfeed-org-files (list "~/.emacs.d/rss_feeds/elfeed.org"))))
#+END_SRC
** Add 'elfeed' for 'notestation' laptop for personal RSS usage, and custom functions to make 'elfeed' easier to use
#+BEGIN_SRC emacs-lisp
  ;; Taken From Mike Zamansky's Config:
  ;; https://github.com/zamansky/dot-emacs/blob/main/config.org
  (defun elfeed-load-db-and-open ()
    "Wrapper to load the elfeed database from the harddisk before opening elfeed"
    (interactive)
    (elfeed-db-load)
    (elfeed)
    (elfeed-search-update--force))

  (defun elfeed-save-db-and-bury ()
    "Wrapper to save the elfeed database to harddisk before killing elfeed buffer"
    (interactive)
    (elfeed-db-save)
    (quit-window))

  (when (member (system-name) '("notestation" "fossastation"))
      (use-package elfeed
	:ensure t
	:bind (:map elfeed-search-mode-map
		    ("q" . elfeed-save-db-and-bury)
		    ("Q" . elfeed-save-db-and-bury))))
#+END_SRC
** Add Org Capture templates for personal use ('Things To Do (NOW)', YouTube videos I found, etc)
#+begin_src emacs-lisp
  (when (member (system-name) '("notestation" "fossastation"))
    (setq org-capture-templates
	  ;; Things To Do (NOW):
	  '(("n" "Things To Do (NOW) Capture Template" entry
	     (file+headline "~/hub/notes_private/life.org" "Things To Do (NOW)")
	     "** %^{Status} [#%^{Priority}] %^{Task Title} :%^{Tag}: \n*** Notes:\n%U: %^{Description}")
	    ("l" "Things To Do (LATER) Capture Template" entry
	     (file+headline "~/hub/notes_private/life.org" "Things To Do (LATER)")
	     "** %^{Status} [#%^{Priority}] %^{Task Title} :%^{Tag}: \n*** Notes:\n%U: %^{Description}"))))
	    ;; Latest attempt to add current week entry (Didn't work):
	    ;; ("c" "Completed Task Capture Template" entry
	     ;; (file+headline "~/hub/notes_private/life.org" , "* COMPLETED_TASKS: " , (format-time-string "%Y") , "** Week of "  (format-time-string "%m-%d-%Y"))
	     ;; "** %^{Status} [#%^{Priority}] %^{Task Title} :%^{Tag}: \n*** Notes:\n%U: %^{Description}"))))
  ;; 1. Determine how to somehow evaluate the following type of headline to place it in the correct 'COMPLETED_TASKS' headline
  ;; Goal: 'COMPLETED_TASKS: (current year)'
  ;; 2. Determine the current week headline
  ;; Goal: '** Week of (current_date, ex: '11-02-2021')'
  ;; 3. Prompt the user for the youtube link via the same exact '' function I use later in the Emacs config
  ;; Goal: User gets prompted for the link, the link is returned with with the name of the video and the link
  ;; in parentheses 
  ;; NOTE: The following is commmented out while I think about how to do this:
  ;; (("y" "YouTube Video Capture Template" entry
  ;; (file+headline "~/hub/notes_private/life.org" "Things To Do (LATER)")
  ;;"** %^{Status} [#%^{Priority}] %^{Task Title} :%YouTube_Video: \n*** Notes:\n%U: %^{Description}"))	

#+end_src
n** Add Hydra to connect to different servers ("musimatic.xyz", "sambanya.com", "fedoraserver")
#+begin_src emacs-lisp
  (when (member (system-name) '("notestation" "fossastation"))
    ;; Create separate connection based functions to later call within the 'hydra-connect' hydra:
    (defun ssh-into-musimatic-sam ()
      (interactive)
      (find-file "/ssh:sam@musimatic.xyz:/var/www/musimatic"))

    (defun ssh-into-musimatic-git ()
      (interactive)
      (find-file "/ssh:git@musimatic.xyz:/var/www/musimatic"))  

    (defun ssh-into-musimatic-root ()
      (interactive)
      (find-file "/ssh:root@musimatic.xyz:/var/www/musimatic"))

    (defun ssh-into-sambanya-sam ()
      (interactive)
      (find-file "/ssh:sam@sambanya.com:/var/www/sambanya"))

    (defun ssh-into-sambanya-root ()
      (interactive)
      (find-file "/ssh:root@sambanya.com:/var/www/sambanya"))

    (defun ssh-into-fedoraserver-sam ()
      (interactive)
      (find-file "/ssh:sam@fedoraserver:/media/REDHDD"))

    (defhydra hydra-connect (:color pink
				    :hint nil)
      "
    ^Connect^
    ^^^^^^^^^^-----------------------------
    _a_: connect to musimatic.xyz as sam user
    _b_: connect to musimatic.xyz as git user
    _c_: connect to musimatic.xyz as root user
    _d_: connect to sambanya.com as sam user
    _e_: connect to sambanya.com as root user
    _f_: connect to fedoraserver as sam user
    _q_: quit
    "
      ("a" ssh-into-musimatic-sam)
      ("b" ssh-into-musimatic-git)    
      ("c" ssh-into-musimatic-root)
      ("d" ssh-into-sambanya-sam)
      ("e" ssh-into-sambanya-root)
      ("f" ssh-into-fedoraserver-sam)
      ("q" nil))

    (global-set-key (kbd "M-n") 'hydra-connect/body))
#+end_src
* Work Specific
** Org-Capture templates for Zendesk tickets and Intercom chats
#+BEGIN_SRC emacs-lisp
  (when (string= system-name "Samuels-MBP.tampabay.rr.com")
    (setq org-capture-templates
	  ;; Using backtick to allow for 'format-time-string' to be escaped:
	  `(("a" "OPEN Ticket Capture Template" entry
	     (file+headline "~/hub/worknotes_snyk/TodoList/TodoList(2022).org" "Open Tasks")
	     "** OPEN [#%^{Severity}] Ticket #%^{Ticket Number} with %^{Client's First Name} from %^{Company Name} :%^{Snyk Product}: \n*** Link\n- https://snyk.zendesk.com/agent/tickets/%^{Ticket Number}\n*** Notes\n**** Initial Notes\n%U: %^{Current Status}\n*** Result")
	    ("x" "PENDING Capture Template" entry
	     (file+headline "~/hub/worknotes_snyk/TodoList/TodoList(2022).org" "Pending Tasks")
	     "** PENDING [#%^{Severity}] Ticket #%^{Ticket Number} with %^{Client's First Name} from %^{Company Name} :%^{Snyk Product}: \n*** Link\n- https://snyk.zendesk.com/agent/tickets/%^{Ticket Number}\n*** Notes\n**** Initial Notes\n%U: %^{Current Status}\n*** Result")
	    ("1" "DONE Ticket Capture Template" entry
	     (file+headline "~/hub/worknotes_snyk/TodoList/TodoList(2022).org" (concat "COMPLETED: " (format-time-string "%b %Y")))
	     "** DONE [#%^{Severity}] Ticket #%^{Ticket Number} with %^{Client's First Name} from %^{Company Name} :%^{Snyk Product}: \n*** Link\n- https://snyk.zendesk.com/agent/tickets/%^{Ticket Number}\n*** Notes\n**** Initial Notes\n%U: %^{Current Status}\n*** Result\n%^{Result}")
	    ("i" "Intercom Chat Capture Template" entry
	     (file+headline "~/hub/worknotes_snyk/TodoList/TodoList(2022).org" "Intercom Tasks")
	     "** IN-PROGRESS Support Chat with %^{Client's First Name} from %^{Company Name} :Intercom_Chat: \n*** Notes\n**** Initial Notes\n%U: %^{Current Status}\n*** Result")
	    ("m" "Meeting Capture Template" entry
	     (file+headline "~/hub/worknotes_snyk/TodoList/TodoList(2022).org" , (format-time-string "%b %Y"))
	     "** %^{Meeting Name} (%<%a %m-%d-%Y>)\n%U: %^{Current Status}" :clock-in t :clock-resume t))))
	    ;; DRAFT: Placing in comments to figure out how to do this
	    ;; ("c" "Convert Intercom Chat To Zendesk Ticket Capture Template" entry
	    ;; (file+headline "~/hub/worknotes_snyk/TodoList/TodoList(2021).org" "Open Tasks")
	    ;; TODO: Figure out how to find the headline of the current Intercom chat task in 'Intercom Tasks'
	    ;; TODO: Then, figure out how to change 'Support Chat' to: 'Ticket #' instead
	    ;; TODO: Prompt the user for the client's company name as this will be needed for Zendesk itself most likely
	    ;; "** %^{Meeting Name} (%<%a %m-%d-%Y>)\n%U: %^{Current Status}" :clock-in t :clock-resume t)

#+END_SRC
** 'Option' MacOS Key + Return to launch 'vterm'
#+BEGIN_SRC emacs-lisp
  (when (string= system-name "Samuels-MBP.tampabay.rr.com")
    (global-set-key (kbd "<A-return>") 'vterm))
#+END_SRC
* Keybinding Changes
