configuration.el

;; (defhydra hydra-remindkeys (:color pink
;; 			       :hint nil)
;;   "
;; ^Keybindings^
;; ^^^^^^^^^^-----------------------------
;; _C-M-z_: Enable 'evil' and 'evil-collection' for Vim keybindings
;; _S-Return_: launch 'vterm'
;; _C-x w_: launch 'ranger.el'
;; _f12_: toggle full screen for Macbook workaround
;; _C-=_: rotate buffers
;; _f7 and S-f7_: start 'org-tree-slide-mode' for Org Mode based presentations, and stop them
;; _f6_: insert YouTube video link, and return the YouTube video name into pasted buffer
;; _C-x b_: enable iBuffer to check available buffers
;; _C-x C-b_: enable 'helm-buffers-list' to check list of available buffers to switch to via a Helm Mode prompt
;; _f2_: enable zoom-based Hydra to zoom in and out of available Emacs buffer
;; _C-c a_: enable 'Org-Agenda' to view agenda of tasks
;; _C-!_: enable color-theme based Hydra to change color themes on the fly
;; _M-s_: jump to a specific word in a buffer with the 'avy-goto-word-0' function
;; _M-l_: jump to a specific line in a buffer with the 'avy-goto-line' function
;; _M-y_: view the copy and paste clipboard via 'popup-kill-ring' package
;; _C-s_: search in a buffer with Counsel or Swiper via the 'counsel-grep-or-swiper' function
;; _C-c q_: first mark a section of a buffer, and then enable this to see where the highlighted section appears next to edit all instances simultaneously
;; _C-q_: enables 'expand-region' to expand a given region of text
;; _C-c C-0_: enables multiple cursors with 'mc/edit-lines' function
;; _C->_: while 'mc/edit-lines' is enabled, go to the next line
;; _C-<_: while 'mc/edit-lines' is enabled, go to the previousline
;; _C-c C-<_: while 'mc/edit-lines' is enabled, mark all of the lines that are like this
;; _C-M-s-k_: kill all buffers with 'kill-all-buffers' function, useful for end-of-day buffer cleanup
;; _C-c w l_: copy the entire line of text with 'copy-whole-line' function
;; _C-x k_: kill the current buffer with the 'kill-current-buffer' function
;; _s-e_: edit the buffer as the 'sudo' user with the 'sudo-edit' function
;; _C-c w w_: kill an entire word with the 'kill-whole-word' function
;; _C-$_: enable desktop based hydra to save, clear, or revert the current desktop of Emacs buffers via the 'hydra-desktop' hydra
;; _C-c l_: enable lsp-mode for programming based auto-completion
;; _<s tab_: enable source code based yasnippet template for Org Mode
;; _<b tab_: enable bash code based yasnippet template for Org Mode
;; _C-h M-a_: show the major mode keybindings with the 'discover-my-major' function
;; _C-h M-o_: show the minor mode keybindings with the 'discover-my-mode' function
;; _M-x free-keys_: show the available keybindings to use for later use in my Emacs config
;; _M-i_: hover over a word, and find that word in any open buffer on screen via the 'helm-swoop' function
;; _M-I_: hover over a word, and jump to the next instance of the word in the buffer via the 'helm-swoop-back-to-last-point' function
;; _C-c M-i_: hover over a word, and find the next file that contains that specific word via the 'helm-multi-swoop' function
;; _C-x M-i_: hover over a word, and find the next file that contains that specific word via the 'helm-multi-swoop-all' function
;; _C-c e_: edit Emacs config at any time
;; _C-c r_: reload Emacs config at any time
;; _C-c C-p C-b_: add the entire current buffer to an online webpaste, specifically at dpaste.org
;; _C-c C-p C-r_: add the selected region to an online webpaste, specifically at dpaste.org
;; _C-c C-p C-p_: add the selected region or buffer to an online webpaste, specifically at dpaste.org
;; _C-c s_: search for a specific issue on Stack Exchange aka StackOverflow
;; _M-x ytdl_: download YouTube videos directly from Emacs
;; _C-c m_: enable Org-Menu to discover keybindings in Org Mode
;; "
;;   ("q" nil))

;; (global-set-key (kbd "C-=") 'hydra-rotate/body)

(use-package evil
  :ensure t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil))

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))

(global-set-key (kbd "C-M-z") 'evil-mode)

(global-set-key (kbd "<s-return>") 'vterm)

(global-set-key (kbd "C-x w") 'ranger)

(global-set-key (kbd "<f12>") 'toggle-frame-fullscreen)

(defhydra hydra-rotate (:color pink
			       :hint nil)
  "
^Rotate Buffers^
^^^^^^^^^^-----------------------------
_h_: rotate even horizontal
_v_: rotate even vertical
_o_: rotate main horizontal
_e_: rotate main vertical
_t_: rotate tiled
_q_: quit
"
  ("h" rotate:even-horizontal)
  ("v" rotate:even-vertical)
  ("o" rotate:main-horizontal)
  ("e" rotate:main-vertical)
  ("t" rotate:tiled)
  ("q" nil))

(global-set-key (kbd "C-=") 'hydra-rotate/body)

(global-set-key (kbd "<f7>") 'org-tree-slide-mode)
(global-set-key (kbd "S-<f7>") 'org-tree-slide-skip-done-toggle)

(defun get-youtube-video-name ()
  "Grab the video title of a YouTube video using youtube-dl, and place it into an Emacs buffer."
  (interactive)
  (insert
  (shell-command-to-string
   (concat "youtube-dl --get-filename -o '%(title)s' $1"
		(shell-quote-argument
		 (read-string "Enter your YouTube link here: "))))))
(global-set-key (kbd "<f6>") 'get-youtube-video-name)

(global-set-key (kbd "C-x b") 'ibuffer)

(setq ibuffer-expert t)

(global-set-key (kbd "C-x C-b") 'helm-buffers-list)

(defhydra hydra-zoom (global-map "<f2>")
"zoom"
("g" text-scale-increase "in")
("l" text-scale-decrease "out"))

(global-set-key (kbd "M-x") 'helm-M-x)

(global-set-key "\C-ca" 'org-agenda)

;; NOTE:
;; A few notes in terms of disabling current theme to then create a new one
;; Workflow:
;; 'M-x disable theme': Disable the current theme
;; Use 'custom-theme-load-path' variable in the Emacs config to set theme path
;; 'M-x describe-face': Describe the face currently under the cursor
  (use-package autothemer
    :ensure t)

(use-package spaceline
  :ensure t
  :config
  (require 'spaceline-config)
  (setq powerline-default-separator (quote arrow))
  (spaceline-spacemacs-theme))

(use-package gruvbox-theme
  :ensure t)

;; Create separate functions to change to each theme
(defun change-to-spacemacs-theme ()
  (interactive)
  (load-theme 'spacemacs-dark t) 
  (enable-theme 'spacemacs-dark)
  (org-mode-restart))

(defun change-to-wordperfect-theme ()
  (interactive)
  (load-theme 'word-perfect t) 
  (enable-theme 'word-perfect)
  (org-mode-restart))

(defun change-to-gruvbox-dark-medium-theme ()
  (interactive)
  (load-theme 'gruvbox-dark-medium t) 
  (enable-theme 'gruvbox-dark-medium)
  (org-mode-restart))

(defhydra hydra-colortheme (:color pink
				   :hint nil)
  "
	  ^Change theme^
	  ^^^^^^^^^^-----------------------------
	  _a_: Spacemacs theme
	  _b_: Wordperfect theme
	  _c_: Gruvbox theme
	  _q_: quit
	  "
  ("a" change-to-spacemacs-theme)
  ("b" change-to-wordperfect-theme)
  ("c" change-to-gruvbox-dark-medium-theme)
  ("q" nil))

(global-set-key (kbd "C-!") 'hydra-colortheme/body)
