configuration.org
*** Dashboard
   #+BEGIN_SRC emacs-lisp
     (use-package dashboard
       :ensure t
       :config
       (dashboard-setup-startup-hook)
       (setq dashboard-items '((recents . 10)))
       (setq dashboard-banner-logo-title "Hello! Welcome to Emacs, have a fun time!"))
   #+END_SRC
*** Rainbow-Mode
   #+BEGIN_SRC emacs-lisp
     (use-package rainbow-mode
       :ensure t
       :init (add-hook 'prog-mode-hook 'rainbow-mode))
   #+END_SRC
*** Beacon
   #+BEGIN_SRC emacs-lisp
   (use-package beacon
   :ensure t
   :init 
   (beacon-mode 1))
   #+END_SRC
*** Disable Default Tool Bar, Menu Bar, And Scroll Bar
   #+BEGIN_SRC emacs-lisp
   ;; Disable default terrible GUI based UI to allow more focus on the editor itself:
   (tool-bar-mode -1)
   (menu-bar-mode -1)
   (scroll-bar-mode -1)
   #+END_SRC
*** Color Theme
   Load color theme, and do 'org-restart' to make sure the theme loads correctly:
   #+BEGIN_SRC emacs-lisp
   ;; (load-theme 'wheatgrass)
   (load-theme 'spacemacs-dark)
   (org-mode-restart)
   #+END_SRC
*** Highlight Current Line In GUI Version Of Emacs
   #+BEGIN_SRC emacs-lisp
   (when window-system (add-hook 'prog-mode-hook (lambda() (set-face-background 'highlight "#222") (hl-line-mode 1))))
   (when window-system (add-hook 'text-mode-hook (lambda() (set-face-background 'highlight "#222") (hl-line-mode 1))))
   #+END_SRC
*** Enable 'scroll-conservatively' to allow for sane scroll defaults at the bottom of a buffer instead of default jumping behavior
   #+BEGIN_SRC emacs-lisp
   (setq scroll-conservatively 100)
   #+END_SRC
*** Disable annoying default bell for warning messages:
   #+BEGIN_SRC emacs-lisp
   (setq ring-bell-function 'ignore)
   #+END_SRC
*** Which-Key
   #+BEGIN_SRC emacs-lisp
   (use-package which-key
   :ensure t
   :init
   (which-key-mode 1))
   #+END_SRC
*** Avy: Use 'M-s' for 'avy-goto-word-0', and use 'M-l' for 'avy-goto-line'
   #+BEGIN_SRC emacs-lisp
     (use-package avy
       :ensure t
       :bind
       ("M-s" . avy-goto-word-0)
       ("M-l" . avy-goto-line))
   #+END_SRC
*** Switch-Window
   #+BEGIN_SRC emacs-lisp
     (use-package switch-window
       :ensure t
       :config
       (setq switch-window-input-style 'minibuffer)
       (setq switch-window-increase 4)
       (setq switch-window-threshold 2)
       (setq switch-window-shortcut-style 'qwerty)
       (setq switch-window-querty-shortcuts
	     '("a" "s" "d" "f" "h" "j" "k" "l"))
       :bind
       ([remap other-window] . switch-window))
   #+END_SRC
*** 'popup-kill-ring' to interactively obtain kill ring paste buffer
#+BEGIN_SRC emacs-lisp
  (use-package popup-kill-ring
    :ensure t
    :bind("M-y" . popup-kill-ring))
#+END_SRC
*** Swiper
#+BEGIN_SRC emacs-lisp
  (use-package swiper
    :ensure t)
    ;; :bind ("C-s" . swiper))
#+END_SRC
*** 'mark-multiple' to mark multiple sections of the buffer
#+BEGIN_SRC emacs-lisp
  (use-package mark-multiple
    :ensure t
    :bind ("C-c q" . 'mark-next-like-this))
#+END_SRC
*** 'expand-region' to expand the current highlighted region, useful in conjunction with 'mark-multiple'
#+BEGIN_SRC emacs-lisp
  (use-package expand-region
    :ensure t
    :bind ("C-q" . er/expand-region))
#+END_SRC
*** Add 'rotate' to rotate windows, 'tmux' style in Emacs
#+BEGIN_SRC emacs-lisp
  (use-package rotate
    :ensure t)
#+END_SRC
*** Add 'multiple-cursors' to edit text insanely fast
#+BEGIN_SRC emacs-lisp
  ;; Note: When I get better at using this, do more crazier keybindings with the 'Command overview' section:
  ;; https://github.com/magnars/multiple-cursors.el
  (use-package multiple-cursors
    :ensure t
    :bind
    ("C-c C-0" . mc/edit-lines)
    ("C->" . mc/mark-next-line-like-this)
    ("C-<" . mc/mark-previous-line-like-this)
    ("C-c C-<" . mc/mark-all-like-this))
#+END_SRC
*** Add 'goto-line-preview' to replace default 'goto-line' Emacs function
#+BEGIN_SRC emacs-lisp
  (use-package goto-line-preview
    :ensure t)

  (global-set-key [remap goto-line] 'goto-line-preview)
#+END_SRC
*** Add 'visual-regexp' to easily view soon-to-be replaced text with 'vr/replace' and 'vr/query command
#+BEGIN_SRC emacs-lisp
  (use-package visual-regexp
    :ensure t)
#+END_SRC
*** Show lines and columns on the modeline
   #+BEGIN_SRC emacs-lisp
     (line-number-mode 1)
     (column-number-mode 1)
   #+END_SRC
*** Show clock in 24-hr format, and display date + time
   #+BEGIN_SRC emacs-lisp
     (setq display-time-24hr-format t)
     (setq display-time-day-and-date t)
     (display-time-mode 1)
   #+END_SRC
*** Change 'yes or no' prompt to just 'y or n':
   #+BEGIN_SRC emacs-lisp
   (defalias 'yes-or-no-p 'y-or-n-p)
   #+END_SRC
*** Window Splitting Functions (Horizontal And Vertical)
#+BEGIN_SRC emacs-lisp
(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
#+END_SRC
*** Enable Subword-Mode so that you can go forward and backward between camel-case words
   #+BEGIN_SRC emacs-lisp
     (global-subword-mode 1)
   #+END_SRC
*** Kill-all-buffers function
   #+BEGIN_SRC emacs-lisp
     (defun kill-all-buffers()
       (interactive)
       (mapc 'kill-buffer (buffer-list)))

     (global-set-key (kbd "C-M-s-k") 'kill-all-buffers)
   #+END_SRC
*** Copy-whole-line function
   #+BEGIN_SRC emacs-lisp
     (defun copy-whole-line ()
       (interactive)
       (save-excursion
	 (kill-new
	  (buffer-substring
	   (point-at-bol)
	   (point-at-eol)))))

     (global-set-key (kbd "C-c w l") 'copy-whole-line)
   #+END_SRC
*** Always kill current buffer function
   #+BEGIN_SRC emacs-lisp
     (defun kill-current-buffer()
       (interactive)
       (kill-buffer (current-buffer)))

     (global-set-key (kbd "C-x k") 'kill-current-buffer)
   #+END_SRC
*** Sudo Edit
   #+BEGIN_SRC emacs-lisp
     (use-package sudo-edit
       :ensure t
       :bind ("s-e" . sudo-edit))
   #+END_SRC
*** Enable Hungry-Delete to delete white-space character regions more easily
   #+BEGIN_SRC emacs-lisp
     (use-package hungry-delete
       :ensure t
       :config (global-hungry-delete-mode))
   #+END_SRC
*** Kill-Whole-Word Function: Vim-like idea of killing an individual word
   #+BEGIN_SRC emacs-lisp
     (defun kill-whole-word()
       (interactive)
       (backward-word)
       (kill-word 1))

     (global-set-key (kbd "C-c w w") 'kill-whole-word)
   #+END_SRC
*** Add 'eyebrowse' to have 'tmux' style window management
#+begin_src emacs-lisp
  (use-package eyebrowse
    :ensure t)
#+end_src
*** Add visual wordwrap in every text mode
#+begin_src emacs-lisp
;; From this post:
;; https://www.reddit.com/r/emacs/comments/43vfl1/enable_wordwrap_in_orgmode/czl98d4/
(add-hook 'text-mode-hook 'turn-on-visual-line-mode)
#+end_src
*** Add 'hydra-desktop' to add desktop functionality to save workspaces in Emacs
#+begin_src emacs-lisp
  ;; Taken from this Wordpress blog post:
  ;; https://ericjmritz.wordpress.com/2015/10/14/some-personal-hydras-for-gnu-emacs/#desktops
  (defhydra hydra-desktop (:color pink
				  :hint nil)
    "
      ^Change desktops^
      ^^^^^^^^^^-----------------------------
      _c_: clear the desktop
      _s_: save the desktop
      _r_: revert the desktop
      _d_: change the directory for the desktop
      _q_: quit
      "
    ("c" desktop-clear "clear")
    ("s" desktop-save "save")
    ("r" desktop-revert "revert")
    ("d" desktop-change-dir "dir")
    ("q" nil))

    (global-set-key (kbd "C-$") 'hydra-desktop/body)
#+end_src
** Terminal
*** Add 'vterm' to enable only decent Emacs terminal
#+begin_src emacs-lisp
  (use-package vterm
    :ensure t)
#+end_src

** Programming
*** Add 'magit' for making dealing with Git repositories easier
#+begin_src emacs-lisp
  (use-package magit
    :ensure t)
#+end_src
*** Add 'emmet-mode' to make HTML editing easier
#+BEGIN_SRC emacs-lisp
  (use-package emmet-mode
    :ensure t
    :hook ((mhtml-mode css-mode scss-mode rjsx-mode) . emmet-mode))
#+END_SRC
*** Add 'rainbow-delimiters' to easily view delimiters in code
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :config
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+END_SRC
*** Add 'log4j-mode' for viewing logs
#+BEGIN_SRC emacs-lisp
  (use-package log4j-mode
    :ensure t)
#+END_SRC
*** Add 'counsel' to specifically use the 'counsel-grep-or-swiper' for searching through large log files
#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :ensure t
    :bind ("C-s" . counsel-grep-or-swiper))
#+END_SRC
*** Add 'csv-mode' to easily work with '.csv' files
#+BEGIN_SRC emacs-lisp
  (use-package csv-mode
    :ensure t
    :mode (".tsv" ".csv" ".tabular" ".vcf"))
#+END_SRC
*** Add 'logview' mode for syntax highlighting, filtering, etc for log files
#+BEGIN_SRC emacs-lisp
  (use-package logview
    :ensure t)
#+END_SRC
*** Add 'lsp-mode' for better autocompletion for many programming languages (python, ruby, java, C++)
#+begin_src emacs-lisp
  (defun ef/lsp-mode-setup ()
    ;; Taken from this 'System Crafters' video:
    ;; https://www.youtube.com/watch?v=E-NAM9U5JYE
    ;; This allows breadcrumb segments to appear in projects
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :ensure t
    :commands (lsp lsp-deferred)
    ;; Taken from this page:
    ;; https://www.mattduck.com/lsp-python-getting-started.html
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t)
    ;; Set 'lsp-idle-delay' to 0.5 seconds for quick autocompletion
    (setq lsp-idle-delay 0.5))
#+end_src

*** Add 'typescript-mode' for Typescript support for 'lsp-mode'
#+begin_src emacs-lisp
  (use-package typescript-mode
    :ensure t
    :mode ("\\.ts\\'" "\\.tsx\\'")
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))
#+end_src
