configuration.el

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-items '((recents . 10)))
  (setq dashboard-banner-logo-title "Hello! Welcome to Emacs, have a fun time!"))

(use-package rainbow-mode
  :ensure t
  :init (add-hook 'prog-mode-hook 'rainbow-mode))

(use-package beacon
:ensure t
:init 
(beacon-mode 1))

;; Disable default terrible GUI based UI to allow more focus on the editor itself:
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

;; (load-theme 'wheatgrass)
(load-theme 'spacemacs-dark)
(org-mode-restart)

(when window-system (add-hook 'prog-mode-hook (lambda() (set-face-background 'highlight "#222") (hl-line-mode 1))))
(when window-system (add-hook 'text-mode-hook (lambda() (set-face-background 'highlight "#222") (hl-line-mode 1))))

(setq scroll-conservatively 100)

(setq ring-bell-function 'ignore)

(use-package which-key
:ensure t
:init
(which-key-mode 1))

(use-package avy
  :ensure t
  :bind
  ("M-s" . avy-goto-word-0)
  ("M-l" . avy-goto-line))

(use-package switch-window
  :ensure t
  :config
  (setq switch-window-input-style 'minibuffer)
  (setq switch-window-increase 4)
  (setq switch-window-threshold 2)
  (setq switch-window-shortcut-style 'qwerty)
  (setq switch-window-querty-shortcuts
	'("a" "s" "d" "f" "h" "j" "k" "l"))
  :bind
  ([remap other-window] . switch-window))

(use-package popup-kill-ring
  :ensure t
  :bind("M-y" . popup-kill-ring))

(use-package swiper
  :ensure t)
  ;; :bind ("C-s" . swiper))

(use-package mark-multiple
  :ensure t
  :bind ("C-c q" . 'mark-next-like-this))

(use-package expand-region
  :ensure t
  :bind ("C-q" . er/expand-region))

(use-package rotate
  :ensure t)

;; Note: When I get better at using this, do more crazier keybindings with the 'Command overview' section:
;; https://github.com/magnars/multiple-cursors.el
(use-package multiple-cursors
  :ensure t
  :bind
  ("C-c C-0" . mc/edit-lines)
  ("C->" . mc/mark-next-line-like-this)
  ("C-<" . mc/mark-previous-line-like-this)
  ("C-c C-<" . mc/mark-all-like-this))

(use-package goto-line-preview
  :ensure t)

(global-set-key [remap goto-line] 'goto-line-preview)

(use-package visual-regexp
  :ensure t)

(line-number-mode 1)
(column-number-mode 1)

(setq display-time-24hr-format t)
(setq display-time-day-and-date t)
(display-time-mode 1)

(defalias 'yes-or-no-p 'y-or-n-p)

(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)

(global-subword-mode 1)

(defun kill-all-buffers()
  (interactive)
  (mapc 'kill-buffer (buffer-list)))

(global-set-key (kbd "C-M-s-k") 'kill-all-buffers)

(defun copy-whole-line ()
  (interactive)
  (save-excursion
    (kill-new
     (buffer-substring
      (point-at-bol)
      (point-at-eol)))))

(global-set-key (kbd "C-c w l") 'copy-whole-line)

(defun kill-current-buffer()
  (interactive)
  (kill-buffer (current-buffer)))

(global-set-key (kbd "C-x k") 'kill-current-buffer)

(use-package sudo-edit
  :ensure t
  :bind ("s-e" . sudo-edit))

(use-package hungry-delete
  :ensure t
  :config (global-hungry-delete-mode))

(defun kill-whole-word()
  (interactive)
  (backward-word)
  (kill-word 1))

(global-set-key (kbd "C-c w w") 'kill-whole-word)

(use-package eyebrowse
  :ensure t)

;; From this post:
;; https://www.reddit.com/r/emacs/comments/43vfl1/enable_wordwrap_in_orgmode/czl98d4/
(add-hook 'text-mode-hook 'turn-on-visual-line-mode)

;; Taken from this Wordpress blog post:
;; https://ericjmritz.wordpress.com/2015/10/14/some-personal-hydras-for-gnu-emacs/#desktops
(defhydra hydra-desktop (:color pink
				:hint nil)
  "
    ^Change desktops^
    ^^^^^^^^^^-----------------------------
    _c_: clear the desktop
    _s_: save the desktop
    _r_: revert the desktop
    _d_: change the directory for the desktop
    _q_: quit
    "
  ("c" desktop-clear "clear")
  ("s" desktop-save "save")
  ("r" desktop-revert "revert")
  ("d" desktop-change-dir "dir")
  ("q" nil))

  (global-set-key (kbd "C-$") 'hydra-desktop/body)

(use-package vterm
  :ensure t)

(use-package magit
  :ensure t)

(use-package emmet-mode
  :ensure t
  :hook ((mhtml-mode css-mode scss-mode rjsx-mode) . emmet-mode))

(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package log4j-mode
  :ensure t)

(use-package counsel
  :ensure t
  :bind ("C-s" . counsel-grep-or-swiper))

(use-package csv-mode
  :ensure t
  :mode (".tsv" ".csv" ".tabular" ".vcf"))

(use-package logview
  :ensure t)

(defun ef/lsp-mode-setup ()
  ;; Taken from this 'System Crafters' video:
  ;; https://www.youtube.com/watch?v=E-NAM9U5JYE
  ;; This allows breadcrumb segments to appear in projects
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :ensure t
  :commands (lsp lsp-deferred)
  ;; Taken from this page:
  ;; https://www.mattduck.com/lsp-python-getting-started.html
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t)
  ;; Set 'lsp-idle-delay' to 0.5 seconds for quick autocompletion
  (setq lsp-idle-delay 0.5))

(use-package typescript-mode
  :ensure t
  :mode ("\\.ts\\'" "\\.tsx\\'")
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))
