configuration.org
*** Add 'web-mode' for support for .html, .ejs, .tsx, and .jsx files
#+begin_src emacs-lisp
(use-package web-mode
  :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
  :config
  (setq-default web-mode-code-indent-offset 2)
  (setq-default web-mode-markup-indent-offset 2)
  (setq-default web-mode-attribute-indent-offset 2))
#+end_src
*** Add 'yaml-mode' for support for '.yaml' files
#+begin_src emacs-lisp
(use-package yaml-mode
  :mode "\\.ya?ml\\'")
#+end_src
*** Add 'company' Mode for auto-completion in conjunction with 'lsp-mode'
#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
		("<tab>" . company-complete-selection))
    (:map lsp-mode-map
	  ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))
#+end_src
*** Add 'flycheck' for programming syntax checking on-the-fly
#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :ensure t
    :init
    (global-flycheck-mode t))
#+END_SRC
*** Use 'Diminish' to hide amazing minor modes which are not necessary to be reminded of all the time
#+BEGIN_SRC emacs-lisp
  (use-package diminish
    :ensure t
    :init
    (diminish 'hungry-delete-mode)
    (diminish 'beacon-mode)
    (diminish 'which-key-mode)
    (diminish 'subword-mode)
    (diminish 'rainbow-mode))
#+END_SRC
*** Rainbow-Delimiters
   #+BEGIN_SRC emacs-lisp
     (use-package rainbow-delimiters
       :ensure t
       :init
       (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
   #+END_SRC
*** 'yasnippet' to utilize snippet templates with 'M-x yas-describe-tables' (Note: Make sure your created snippets match mode's name, ex: '~/.emacs.d/snippets/python-mode')
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (use-package yasnippet-snippets
      :ensure t)
    ;; Taken from this SO post:
    ;; https://stackoverflow.com/questions/46696009/adding-a-custom-yasnippet-directory-to-spacemacs
    (setq yas-snippet-dirs (append yas-snippet-dirs '("~/.emacs.d/snippets")))
    (yas-reload-all))
#+END_SRC
*** Add hook so that 'yasnippet' minor mode is enabled for certain modes (programming: 'C, C++, Python, JS', 'nXML', Org-Mode)
#+BEGIN_SRC emacs-lisp
  (add-hook 'c-mode-hook 'yas-minor-mode)
  (add-hook 'c++-mode-hook 'yas-minor-mode)
  (add-hook 'python-mode-hook 'yas-minor-mode)
  (add-hook 'emacs-lisp-mode-hook 'yas-minor-mode)
  (add-hook 'org-mode-hook 'yas-minor-mode)
  (add-hook 'nxml-mode-hook 'yas-minor-mode)
#+END_SRC
*** Nuke Emacs 27.2's annoying issue of automatically expanding source blocks which ruins my Yasnippet override template
#+BEGIN_SRC emacs-lisp
  (setq org-src-tab-acts-natively nil)
#+END_SRC
*** Enable Electric to auto-complete / add parentheses whenever possible
   #+BEGIN_SRC emacs-lisp
     (setq electric-pair-pairs '(
				 (?\( . ?\))
				 (?\[ . ?\])
				 (?\{ . ?\})			    
				 ))

     (electric-pair-mode 1)

     ;; Disable pairing of '<' with '>' to avoid weird expansion issues in Org-Mode for Yasnippets:
     (add-function :before-until electric-pair-inhibit-predicate
		   (lambda (c) (eq c ?<)))
   #+END_SRC
*** Indent with spaces, not tabs, by nuking 'indent-tabs-mode'
#+begin_src emacs-lisp
  (progn
    (setq-default indent-tabs-mode nil)
    )
#+end_src
*** Add 'aggressive-intent' to every thing
#+begin_src emacs-lisp
  (use-package aggressive-indent
    :ensure t
    :hook
    (css-mode . aggressive-indent-mode)
    (emacs-lisp-mode . aggressive-indent-mode)
    (js-mode . aggressive-indent-mode)
    (typescript-mode . aggressive-indent-mode)
    (lisp-mode . aggressive-indent-mode)
    :custom
    (aggressive-indent-comments-too t)
    :config
    (add-to-list 'aggressive-indent-protected-commands 'comment-dwim))
#+end_src
*** Add 'css-mode' for working with '.css' stylesheets
#+begin_src emacs-lisp
  (use-package css-mode
    :custom
    (css-indent-offset 2))
#+end_src
** Keybinding Packages
*** Add 'discover-my-major' to discover keybindings in a given major or minor mode with 'C-h M-a' and 'C-h M-o'
#+BEGIN_SRC emacs-lisp
  (use-package discover-my-major
    :ensure t)

  (global-set-key (kbd "C-h M-a") 'discover-my-major)
  (global-set-key (kbd "C-h M-o") 'discover-my-mode)
#+END_SRC
*** Add 'free-keys' to determine the free keybindings present currently available in Emacs
#+begin_src emacs-lisp
  (use-package free-keys
    :ensure t)
#+end_src
** Helm Related Packages
*** Helm-Mode
   #+BEGIN_SRC emacs-lisp
     (use-package helm
       :ensure t
       :init
       (helm-mode 1)
       :config
       (setq helm-move-to-line-cycle-in-source t))
   #+END_SRC
*** Add 'helm-swoop' and bind to 'M-i', 'C-c M-i', 'C-x M-i'
#+BEGIN_SRC emacs-lisp
  (use-package helm-swoop
    :ensure t)

  (global-set-key (kbd "M-i") 'helm-swoop)
  (global-set-key (kbd "M-I") 'helm-swoop-back-to-last-point)
  (global-set-key (kbd "C-c M-i") 'helm-multi-swoop)
  (global-set-key (kbd "C-x M-i") 'helm-multi-swoop-all)

  ;; When doing isearch, hand the word over to helm-swoop
  (define-key isearch-mode-map (kbd "M-i") 'helm-swoop-from-isearch)

  ;; From helm-swoop to helm-multi-swoop-all
  (define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)

  ;; Move up and down like isearch
  (define-key helm-swoop-map (kbd "C-p") 'helm-previous-line)
  (define-key helm-swoop-map (kbd "C-n") 'helm-next-line)
  (define-key helm-multi-swoop-map (kbd "C-p") 'helm-previous-line)
  (define-key helm-multi-swoop-map (kbd "C-n") 'helm-next-line)

  ;; Save buffer when helm-multi-swoop-edit complete
  (setq helm-multi-swoop-edit-save t)

  ;; If this value is t, split window inside the current window
  (setq helm-swoop-split-with-multiple-windows nil)

  ;; Split direcion. 'split-window-vertically or 'split-window-horizontally
  (setq helm-swoop-split-direction 'split-window-vertically)

  ;; If nil, you can slightly boost invoke speed in exchange for text color
  (setq helm-swoop-speed-or-color nil)

  ;; ;; Go to the opposite side of line from the end or beginning of line
  (setq helm-swoop-move-to-line-cycle t)

  ;; Optional face for line numbers
  ;; Face name is `helm-swoop-line-number-face`
  (setq helm-swoop-use-line-number-face t)

  ;; If you prefer fuzzy matching
  (setq helm-swoop-use-fuzzy-match t)
#+END_SRC
** File Manager
*** Nuke 'dired' mode's ability to open so many buffers
#+BEGIN_SRC emacs-lisp
  ;; Taken From Xah Lee's Site:
  ;; http://ergoemacs.org/emacs/emacs_dired_tips.html

  ;; Also taken from this SO post:
  ;; https://stackoverflow.com/questions/1839313/how-do-i-stop-emacs-dired-mode-from-opening-so-many-buffers

  ;; Make a wrapper function to force dired-mode to load first:
  (with-eval-after-load 'dired
    ;; Disable annoying warning to utilize 'dired-find-alternate-file' function:
    (put 'dired-find-alternate-file 'disabled nil)

    ;; Nuke 'dired' mode's ability to unnecessarily create so many buffers with the sane 'ENTER' key press:
    (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)

    ;; Do the same action, but for the '^' key as well since the same issue of creating too many buffers exists
    ;; for the '^' key by default
    (define-key dired-mode-map (kbd "^")
      (lambda () (interactive)
	(find-alternate-file ".."))))
#+END_SRC
*** Enable 'ranger.el' for occassional use
#+begin_src emacs-lisp
  (use-package ranger
    :ensure t)
#+end_src
*** Force 'ranger.el' to show hidden files by default
#+begin_src emacs-lisp
  (setq ranger-show-hidden t)
#+end_src
*** Force 'ranger.el' to stop allowing 'Deer' mode from 'dired'
#+begin_src emacs-lisp
(remove-hook 'dired-mode-hook 'ranger-set-dired-key)
#+end_src
** eww
*** Make 'eww' the default browser for Emacs
#+BEGIN_SRC emacs-lisp
(setq browse-url-browser-function 'eww-browse-url)
#+END_SRC
** Org-Mode
*** Create custom 'my-org-capture' function to force 'Org-Capture' to split vertically
#+BEGIN_SRC emacs-lisp
  (defun my-org-capture (&rest args)
    (interactive)
    (let ((split-window-preferred-function 'split-window-vertically))
      (funcall 'org-capture)))

  (global-set-key (kbd "C-c c") 'my-org-capture)
#+END_SRC
*** Nuke 'electric-indent-local-mode' via an Org Mode hook function so that lines aren't auto-indented after list items
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook
	    (lambda ()
	      (electric-indent-local-mode -1)))
#+END_SRC
*** Nuke 'org-adapt-indentation' variable setting value introduced in Emacs 27.2 so lines aren't auto-indented after headlines
#+BEGIN_SRC emacs-lisp
(setq org-adapt-indentation nil)
#+END_SRC   
*** Nuke 'org-startup-folded' variable setting value introduced in Emacs 27.2 so org docs aren't automatically expanded
#+BEGIN_SRC emacs-lisp
(setq org-startup-folded t)
#+END_SRC   
*** Add time-tracking for Org-Mode todo item state changes to place into ':LOGBOOK:' drawer
   #+BEGIN_SRC emacs-lisp
     (setq org-log-into-drawer "LOGBOOK")
   #+END_SRC
*** Set 'org-agenda-files' variable so that Org-Mode sees all scheduled items in Org-Agenda
   #+BEGIN_SRC emacs-lisp
     (setq org-agenda-files (append
			     (file-expand-wildcards "~/hub/notes_private/*.org")))
   #+END_SRC
*** Allow Org-Mode to edit SRC blocks within the same window
   #+BEGIN_SRC emacs-lisp
   (setq org-src-window-setup 'current-window)
   #+END_SRC
*** Allow Org-Mode to use an emacs-lisp src block template
   #+BEGIN_SRC emacs-lisp
     (add-to-list 'org-structure-template-alist
		  '("el" . "src emacs-lisp"))
   #+END_SRC
