configuration.el

(use-package web-mode
  :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
  :config
  (setq-default web-mode-code-indent-offset 2)
  (setq-default web-mode-markup-indent-offset 2)
  (setq-default web-mode-attribute-indent-offset 2))

(use-package yaml-mode
  :mode "\\.ya?ml\\'")

(use-package company
  :ensure t
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
	      ("<tab>" . company-complete-selection))
  (:map lsp-mode-map
	("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode t))

(use-package diminish
  :ensure t
  :init
  (diminish 'hungry-delete-mode)
  (diminish 'beacon-mode)
  (diminish 'which-key-mode)
  (diminish 'subword-mode)
  (diminish 'rainbow-mode))

(use-package rainbow-delimiters
  :ensure t
  :init
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))

(use-package yasnippet
  :ensure t
  :config
  (use-package yasnippet-snippets
    :ensure t)
  ;; Taken from this SO post:
  ;; https://stackoverflow.com/questions/46696009/adding-a-custom-yasnippet-directory-to-spacemacs
  (setq yas-snippet-dirs (append yas-snippet-dirs '("~/.emacs.d/snippets")))
  (yas-reload-all))

(add-hook 'c-mode-hook 'yas-minor-mode)
(add-hook 'c++-mode-hook 'yas-minor-mode)
(add-hook 'python-mode-hook 'yas-minor-mode)
(add-hook 'emacs-lisp-mode-hook 'yas-minor-mode)
(add-hook 'org-mode-hook 'yas-minor-mode)
(add-hook 'nxml-mode-hook 'yas-minor-mode)

(setq org-src-tab-acts-natively nil)

(setq electric-pair-pairs '(
			    (?\( . ?\))
			    (?\[ . ?\])
			    (?\{ . ?\})			    
			    ))

(electric-pair-mode 1)

;; Disable pairing of '<' with '>' to avoid weird expansion issues in Org-Mode for Yasnippets:
(add-function :before-until electric-pair-inhibit-predicate
	      (lambda (c) (eq c ?<)))

(progn
  (setq-default indent-tabs-mode nil)
  )

(use-package aggressive-indent
  :ensure t
  :hook
  (css-mode . aggressive-indent-mode)
  (emacs-lisp-mode . aggressive-indent-mode)
  (js-mode . aggressive-indent-mode)
  (typescript-mode . aggressive-indent-mode)
  (lisp-mode . aggressive-indent-mode)
  :custom
  (aggressive-indent-comments-too t)
  :config
  (add-to-list 'aggressive-indent-protected-commands 'comment-dwim))

(use-package css-mode
  :custom
  (css-indent-offset 2))

(use-package discover-my-major
  :ensure t)

(global-set-key (kbd "C-h M-a") 'discover-my-major)
(global-set-key (kbd "C-h M-o") 'discover-my-mode)

(use-package free-keys
  :ensure t)

(use-package helm
  :ensure t
  :init
  (helm-mode 1)
  :config
  (setq helm-move-to-line-cycle-in-source t))

(use-package helm-swoop
  :ensure t)

(global-set-key (kbd "M-i") 'helm-swoop)
(global-set-key (kbd "M-I") 'helm-swoop-back-to-last-point)
(global-set-key (kbd "C-c M-i") 'helm-multi-swoop)
(global-set-key (kbd "C-x M-i") 'helm-multi-swoop-all)

;; When doing isearch, hand the word over to helm-swoop
(define-key isearch-mode-map (kbd "M-i") 'helm-swoop-from-isearch)

;; From helm-swoop to helm-multi-swoop-all
(define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)

;; Move up and down like isearch
(define-key helm-swoop-map (kbd "C-p") 'helm-previous-line)
(define-key helm-swoop-map (kbd "C-n") 'helm-next-line)
(define-key helm-multi-swoop-map (kbd "C-p") 'helm-previous-line)
(define-key helm-multi-swoop-map (kbd "C-n") 'helm-next-line)

;; Save buffer when helm-multi-swoop-edit complete
(setq helm-multi-swoop-edit-save t)

;; If this value is t, split window inside the current window
(setq helm-swoop-split-with-multiple-windows nil)

;; Split direcion. 'split-window-vertically or 'split-window-horizontally
(setq helm-swoop-split-direction 'split-window-vertically)

;; If nil, you can slightly boost invoke speed in exchange for text color
(setq helm-swoop-speed-or-color nil)

;; ;; Go to the opposite side of line from the end or beginning of line
(setq helm-swoop-move-to-line-cycle t)

;; Optional face for line numbers
;; Face name is `helm-swoop-line-number-face`
(setq helm-swoop-use-line-number-face t)

;; If you prefer fuzzy matching
(setq helm-swoop-use-fuzzy-match t)

;; Taken From Xah Lee's Site:
;; http://ergoemacs.org/emacs/emacs_dired_tips.html

;; Also taken from this SO post:
;; https://stackoverflow.com/questions/1839313/how-do-i-stop-emacs-dired-mode-from-opening-so-many-buffers

;; Make a wrapper function to force dired-mode to load first:
(with-eval-after-load 'dired
  ;; Disable annoying warning to utilize 'dired-find-alternate-file' function:
  (put 'dired-find-alternate-file 'disabled nil)

  ;; Nuke 'dired' mode's ability to unnecessarily create so many buffers with the sane 'ENTER' key press:
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)

  ;; Do the same action, but for the '^' key as well since the same issue of creating too many buffers exists
  ;; for the '^' key by default
  (define-key dired-mode-map (kbd "^")
    (lambda () (interactive)
      (find-alternate-file ".."))))

(use-package ranger
  :ensure t)

(setq ranger-show-hidden t)

(remove-hook 'dired-mode-hook 'ranger-set-dired-key)

(setq browse-url-browser-function 'eww-browse-url)

(defun my-org-capture (&rest args)
  (interactive)
  (let ((split-window-preferred-function 'split-window-vertically))
    (funcall 'org-capture)))

(global-set-key (kbd "C-c c") 'my-org-capture)

(add-hook 'org-mode-hook
	  (lambda ()
	    (electric-indent-local-mode -1)))

(setq org-adapt-indentation nil)

(setq org-startup-folded t)

(setq org-log-into-drawer "LOGBOOK")

(setq org-agenda-files (append
			(file-expand-wildcards "~/hub/notes_private/*.org")))

(setq org-src-window-setup 'current-window)

(add-to-list 'org-structure-template-alist
	     '("el" . "src emacs-lisp"))
