configuration.org
*** Remove '#' priority from tasks when changing task states
#+begin_src emacs-lisp
  ;; From a wonderful person named Samuel Loury from the Emacs Org Mode mailing list --> props to their assistance on this:
  (defun my/org-trigger-hook (change-plist)
    (let* ((type (plist-get change-plist :type))
	   (pos (plist-get change-plist :position))
	   (from (substring-no-properties (or (plist-get change-plist :from) "")))
	   (to (substring-no-properties (or (plist-get change-plist :to) "")))
	   )
      (when (and
	     (eq type 'todo-state-change)
	     (member to org-done-keywords)
	     (member from org-not-done-keywords)
	     )
	(org-priority (string-to-char " ")))))

  (add-hook #'org-trigger-hook
	    #'my/org-trigger-hook)
#+end_src
** ediff
*** Force 'ediff' to open up vertically in new windows NOT frames
#+BEGIN_SRC emacs-lisp
(advice-add 'ediff-window-display-p :override #'ignore) ; Open up ediff results in new windows not frames
(setq ediff-split-window-function 'split-window-vertically) ; Split the ediff results vertically
#+END_SRC
** Quality Of Life Custom Changes To Improve Default Emacs Behavior
*** Nuke Emacs' ability to make backups and autosaves since its annoying and too bloated
   #+BEGIN_SRC emacs-lisp
     (setq make-backup-files nil)
     (setq auto-save-default nil)
   #+END_SRC
*** Config Edit / Reload Function
**** Edit Config Function
    #+BEGIN_SRC emacs-lisp
      (defun config-edit ()
	(interactive)
	(find-file "~/hub/dotfiles/emacs/.emacs.d/configuration.org"))
      (global-set-key (kbd "C-c e") 'config-edit)
    #+END_SRC
**** Reload Config Function
    #+BEGIN_SRC emacs-lisp
      (defun config-reload ()
	(interactive)
	(org-babel-load-file (expand-file-name "~/hub/dotfiles/emacs/.emacs.d/configuration.org")))
      (global-set-key (kbd "C-c r") 'config-reload)
    #+END_SRC
** Presenting Slides
*** Add 'org-tree-slide' for easy-to-make Org mode based presentations
#+BEGIN_SRC emacs-lisp
  (defun begin-scale-text-and-show-images ()
    (require 'face-remap)
    (hide-mode-line-mode 1)
    (org-display-inline-images)
    (setq text-scale-mode-amount 2)
    ;; Enable 'text-scale-mode', disable 'beacon-mode', and disable 'blink-cursor-mode' while presenting
    (text-scale-mode 1)
    (beacon-mode 0)
    (blink-cursor-mode 0))

  (defun end-scale-text-and-show-images ()
    (hide-mode-line-mode 0)
    ;; Presentation is finished: Disable 'text-scale-mode', re-enable 'beacon-mode', and re-enable 'blink-cursor-mode'
    (text-scale-mode 0)
    (beacon-mode 1)
    (blink-cursor-mode 1))

  (use-package org-tree-slide
    :ensure t
    :hook ((org-tree-slide-play . begin-scale-text-and-show-images)
    (org-tree-slide-stop . end-scale-text-and-show-images))
    :custom
    (org-image-actual-width nil))
#+END_SRC
*** Add 'hide-mode-line' package for hiding Emacs modeline during presentations
#+BEGIN_SRC emacs-lisp
  (use-package hide-mode-line
    :ensure t)
#+END_SRC
** Online Pasting
*** Add 'webpaste.el' to easily paste code snippets to online paste bins
#+BEGIN_SRC emacs-lisp
  (use-package webpaste
    :ensure t
    :bind (("C-c C-p C-b" . webpaste-paste-buffer)
	   ("C-c C-p C-r" . webpaste-paste-region)
	   ("C-c C-p C-p" . webpaste-paste-buffer-or-region))
    :config
    (progn
      (setq webpaste-provider-priority '("dpaste.org"))))
#+END_SRC
** Online Research
*** Add 'SX' to look up issues on Stack Exchange
#+BEGIN_SRC emacs-lisp
  (use-package sx
    :ensure t
    :config
    (bind-keys :prefix "C-c s"
	       :prefix-map sx-map
	       :prefix-docstring "Global keymap for SX."
	       ("q" . sx-tab-all-questions)
	       ("i" . sx-inbox)
	       ("o" . sx-open-link)
	       ("u" . sx-tab-unanswered-my-tags)
	       ("a" . sx-ask)
	       ("s" . sx-search)))
#+END_SRC
** YouTube
*** Add 'ytdl', a package for using 'youtube-dl' within Emacs to easily download YouTube videos
#+begin_src emacs-lisp
  ;; NOTE:
  ;; 2 related functions to keep in mind:
  ;; 1. 'ytdl-download': Used for downloading videos directly from YouTube
  ;; 2. 'ytdl-download-playlist': Used for downloading YouTube playlists
  ;; Reference link:
  ;; https://www.reddit.com/r/emacs/comments/hxbmda/ytdl_an_emacs_interface_for_youtubedl/
  (use-package ytdl
    :ensure t)
#+end_src

